{
    "addition": {
        "133": "   * <p>By default, a {@code Builder} will generate bimaps that iterate over entries in the order\n",
        "134": "   * they were inserted into the builder.  For example, in the above example,\n",
        "135": "   * {@code WORD_TO_INT.entrySet()} is guaranteed to iterate over the entries in the order\n",
        "136": "   * {@code \"one\"=1, \"two\"=2, \"three\"=3}, and {@code keySet()} and {@code values()} respect the same\n",
        "137": "   * order. If you want a different order, consider using\n",
        "138": "   * {@link #orderEntriesByValue(Comparator)}, which changes this builder to sort\n",
        "139": "   * entries by value.\n",
        "140": "   *\n",
        "233": "     * Returns a newly-created immutable bimap.  The iteration order of the returned bimap is\n",
        "234": "     * the order in which entries were inserted into the builder, unless\n",
        "235": "     * {@link #orderEntriesByValue} was called, in which case entries are sorted by value.\n",
        "256": "   * <p>The returned {@code BiMap} iterates over entries in the same order as the\n",
        "257": "   * {@code entrySet} of the original map.\n",
        "258": "   *\n",
        "263": "   * @throws IllegalArgumentException if two keys have the same value or two values have the same\n",
        "264": "   *     key\n",
        "281": "   * Returns an immutable bimap containing the given entries.  The returned bimap iterates over\n",
        "282": "   * entries in the same order as the original iterable.\n",
        "311": "   * Returns an immutable set of the values in this map, in the same order they appear in {@link\n",
        "312": "   * #entrySet}.\n"
    },
    "removed": {
        "225": "     * Returns a newly-created immutable bimap.\n",
        "250": "   * @throws IllegalArgumentException if two keys have the same value\n",
        "267": "   * Returns an immutable bimap containing the given entries.\n",
        "296": "   * Returns an immutable set of the values in this map. The values are in the\n",
        "297": "   * same order as the parameters used to build this map.\n"
    }
}