{
    "addition": {
        "99": " * <p>These features are all optional; caches can be created using all or none of them. By default,\n",
        "233": "  /*\n",
        "234": "   * We avoid using a method reference here for now: Inside Google, CacheBuilder is used from the\n",
        "235": "   * implementation of a custom ClassLoader that is sometimes used as a system classloader. That's a\n",
        "236": "   * problem because method-reference linking tries to look up the system classloader, and it fails\n",
        "237": "   * because there isn't one yet.\n",
        "238": "   *\n",
        "239": "   * I would have guessed that a lambda would produce the same problem, but maybe it's safe because\n",
        "240": "   * the lambda implementation is generated as a method in the _same class_ as the usage?\n",
        "241": "   */\n",
        "242": "  static final Supplier<StatsCounter> CACHE_STATS_COUNTER = () -> new SimpleStatsCounter();\n",
        "932": "   * same instance, but only the returned reference has the correct generic type information to\n",
        "933": "   * ensure type safety. For best results, use the standard method-chaining idiom illustrated in the\n",
        "934": "   * class documentation above, configuring a builder and building your cache in a single statement.\n",
        "935": "   * Failure to heed this advice can result in a {@link ClassCastException} being thrown by a cache\n",
        "936": "   * operation at some <i>undefined</i> point in the future.\n"
    },
    "removed": {
        "99": " * <p>These features are all optional; caches can be created using all or none of them. By default\n",
        "233": "  static final Supplier<StatsCounter> CACHE_STATS_COUNTER =\n",
        "234": "      new Supplier<StatsCounter>() {\n",
        "235": "        @Override\n",
        "236": "        public StatsCounter get() {\n",
        "237": "          return new SimpleStatsCounter();\n",
        "238": "        }\n",
        "239": "      };\n",
        "929": "   * same instance, but only the returned reference has the correct generic type information so as\n",
        "930": "   * to ensure type safety. For best results, use the standard method-chaining idiom illustrated in\n",
        "931": "   * the class documentation above, configuring a builder and building your cache in a single\n",
        "932": "   * statement. Failure to heed this advice can result in a {@link ClassCastException} being thrown\n",
        "933": "   * by a cache operation at some <i>undefined</i> point in the future.\n"
    }
}