{
    "addition": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except\n",
        "5": " * in compliance with the License. You may obtain a copy of the License at\n",
        "9": " * Unless required by applicable law or agreed to in writing, software distributed under the License\n",
        "10": " * is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express\n",
        "11": " * or implied. See the License for the specific language governing permissions and limitations under\n",
        "12": " * the License.\n",
        "136": "   * Accumulates statistics during the operation of a {@link Cache} for presentation by\n",
        "137": "   * {@link Cache#stats}. This is solely intended for consumption by {@code Cache} implementors.\n",
        "151": "     * Records cache misses. This should be called when a cache request returns a value that was not\n",
        "152": "     * found in the cache. This method should be called by the loading thread, as well as by threads\n",
        "153": "     * blocking on the load. Multiple concurrent calls to {@link Cache} lookup methods with the same\n",
        "154": "     * key on an absent value should result in a single call to either {@code recordLoadSuccess} or\n",
        "155": "     * {@code recordLoadException} and multiple calls to this method, despite all being served by\n",
        "156": "     * the results of a single load operation.\n",
        "164": "     * Records the successful load of a new entry. This should be called when a cache request causes\n",
        "165": "     * an entry to be loaded, and the loading completes successfully. In contrast to\n",
        "174": "     * Records the failed load of a new entry. This should be called when a cache request causes an\n",
        "175": "     * entry to be loaded, but an exception is thrown while loading the entry. In contrast to\n",
        "185": "     * is evicted due to the cache's eviction strategy, and not as a result of manual\n",
        "186": "     * {@linkplain Cache#invalidate invalidations}.\n"
    },
    "removed": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\");\n",
        "5": " * you may not use this file except in compliance with the License.\n",
        "6": " * You may obtain a copy of the License at\n",
        "10": " * Unless required by applicable law or agreed to in writing, software\n",
        "11": " * distributed under the License is distributed on an \"AS IS\" BASIS,\n",
        "12": " * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n",
        "13": " * See the License for the specific language governing permissions and\n",
        "14": " * limitations under the License.\n",
        "138": "   * Accumulates statistics during the operation of a {@link Cache} for presentation by {@link\n",
        "139": "   * Cache#stats}. This is solely intended for consumption by {@code Cache} implementors.\n",
        "153": "     * Records cache misses. This should be called when a cache request returns a value that was\n",
        "154": "     * not found in the cache. This method should be called by the loading thread, as well as by\n",
        "155": "     * threads blocking on the load. Multiple concurrent calls to {@link Cache} lookup methods with\n",
        "156": "     * the same key on an absent value should result in a single call to either\n",
        "157": "     * {@code recordLoadSuccess} or {@code recordLoadException} and multiple calls to this method,\n",
        "158": "     * despite all being served by the results of a single load operation.\n",
        "166": "     * Records the successful load of a new entry. This should be called when a cache request\n",
        "167": "     * causes an entry to be loaded, and the loading completes successfully. In contrast to\n",
        "176": "     * Records the failed load of a new entry. This should be called when a cache request causes\n",
        "177": "     * an entry to be loaded, but an exception is thrown while loading the entry. In contrast to\n",
        "187": "     * is evicted due to the cache's eviction strategy, and not as a result of manual {@linkplain\n",
        "188": "     * Cache#invalidate invalidations}.\n"
    }
}