{
    "addition": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except\n",
        "5": " * in compliance with the License. You may obtain a copy of the License at\n",
        "9": " * Unless required by applicable law or agreed to in writing, software distributed under the License\n",
        "10": " * is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express\n",
        "11": " * or implied. See the License for the specific language governing permissions and limitations under\n",
        "12": " * the License.\n",
        "24": " * Static methods pertaining to ASCII characters (those in the range of values {@code 0x00} through\n",
        "25": " * {@code 0x7F}), and to strings containing such characters.\n",
        "31": " * <li>{@link CharMatcher#ASCII} matches ASCII characters and provides text processing methods which\n",
        "32": " * operate only on the ASCII characters of a string.\n",
        "46": "   * Null ('\\0'): The all-zeros character which may serve to accomplish time fill and media fill.\n",
        "47": "   * Normally used as a C string terminator. <p>Although RFC 20 names this as \"Null\", note that it\n",
        "48": "   * is distinct from the C/C++ \"NULL\" pointer.\n",
        "55": "   * Start of Heading: A communication control character used at the beginning of a sequence of\n",
        "56": "   * characters which constitute a machine-sensible address or routing information. Such a sequence\n",
        "57": "   * is referred to as the \"heading.\" An STX character has the effect of terminating a heading.\n",
        "64": "   * Start of Text: A communication control character which precedes a sequence of characters that\n",
        "65": "   * is to be treated as an entity and entirely transmitted through to the ultimate destination.\n",
        "66": "   * Such a sequence is referred to as \"text.\" STX may be used to terminate a sequence of characters\n",
        "67": "   * started by SOH.\n",
        "74": "   * End of Text: A communication control character used to terminate a sequence of characters\n",
        "75": "   * started with STX and transmitted as an entity.\n",
        "82": "   * End of Transmission: A communication control character used to indicate the conclusion of a\n",
        "83": "   * transmission, which may have contained one or more texts and any associated headings.\n",
        "90": "   * Enquiry: A communication control character used in data communication systems as a request for\n",
        "91": "   * a response from a remote station. It may be used as a \"Who Are You\" (WRU) to obtain\n",
        "99": "   * Acknowledge: A communication control character transmitted by a receiver as an affirmative\n",
        "100": "   * response to a sender.\n",
        "107": "   * Bell ('\\a'): A character for use when there is a need to call for human attention. It may\n",
        "108": "   * control alarm or attention devices.\n",
        "115": "   * Backspace ('\\b'): A format effector which controls the movement of the printing position one\n",
        "116": "   * printing space backward on the same printing line. (Applicable also to display devices.)\n",
        "123": "   * Horizontal Tabulation ('\\t'): A format effector which controls the movement of the printing\n",
        "124": "   * position to the next in a series of predetermined positions along the printing line.\n",
        "125": "   * (Applicable also to display devices and the skip function on punched cards.)\n",
        "132": "   * Line Feed ('\\n'): A format effector which controls the movement of the printing position to the\n",
        "133": "   * next printing line. (Applicable also to display devices.) Where appropriate, this character may\n",
        "134": "   * have the meaning \"New Line\" (NL), a format effector which controls the movement of the printing\n",
        "135": "   * point to the first printing position on the next printing line. Use of this convention requires\n",
        "136": "   * agreement between sender and recipient of data.\n",
        "143": "   * Alternate name for {@link #LF}. ({@code LF} is preferred.)\n",
        "150": "   * Vertical Tabulation ('\\v'): A format effector which controls the movement of the printing\n",
        "151": "   * position to the next in a series of predetermined printing lines. (Applicable also to display\n",
        "152": "   * devices.)\n",
        "159": "   * Form Feed ('\\f'): A format effector which controls the movement of the printing position to the\n",
        "160": "   * first pre-determined printing line on the next form or page. (Applicable also to display\n",
        "161": "   * devices.)\n",
        "168": "   * Carriage Return ('\\r'): A format effector which controls the movement of the printing position\n",
        "169": "   * to the first printing position on the same printing line. (Applicable also to display devices.)\n",
        "176": "   * Shift Out: A control character indicating that the code combinations which follow shall be\n",
        "177": "   * interpreted as outside of the character set of the standard code table until a Shift In\n",
        "178": "   * character is reached.\n",
        "185": "   * Shift In: A control character indicating that the code combinations which follow shall be\n",
        "186": "   * interpreted according to the standard code table.\n",
        "193": "   * Data Link Escape: A communication control character which will change the meaning of a limited\n",
        "194": "   * number of contiguously following characters. It is used exclusively to provide supplementary\n",
        "195": "   * controls in data communication networks.\n",
        "202": "   * Device Control 1. Characters for the control of ancillary devices associated with data\n",
        "203": "   * processing or telecommunication systems, more especially switching devices \"on\" or \"off.\" (If a\n",
        "204": "   * single \"stop\" control is required to interrupt or turn off ancillary devices, DC4 is the\n",
        "205": "   * preferred assignment.)\n",
        "212": "   * Transmission On: Although originally defined as DC1, this ASCII control character is now better\n",
        "213": "   * known as the XON code used for software flow control in serial communications. The main use is\n",
        "214": "   * restarting the transmission after the communication has been stopped by the XOFF control code.\n",
        "221": "   * Device Control 2. Characters for the control of ancillary devices associated with data\n",
        "222": "   * processing or telecommunication systems, more especially switching devices \"on\" or \"off.\" (If a\n",
        "223": "   * single \"stop\" control is required to interrupt or turn off ancillary devices, DC4 is the\n",
        "224": "   * preferred assignment.)\n",
        "231": "   * Device Control 3. Characters for the control of ancillary devices associated with data\n",
        "232": "   * processing or telecommunication systems, more especially switching devices \"on\" or \"off.\" (If a\n",
        "233": "   * single \"stop\" control is required to interrupt or turn off ancillary devices, DC4 is the\n",
        "234": "   * preferred assignment.)\n",
        "248": "   * Device Control 4. Characters for the control of ancillary devices associated with data\n",
        "249": "   * processing or telecommunication systems, more especially switching devices \"on\" or \"off.\" (If a\n",
        "250": "   * single \"stop\" control is required to interrupt or turn off ancillary devices, DC4 is the\n",
        "251": "   * preferred assignment.)\n",
        "258": "   * Negative Acknowledge: A communication control character transmitted by a receiver as a negative\n",
        "259": "   * response to the sender.\n",
        "266": "   * Synchronous Idle: A communication control character used by a synchronous transmission system\n",
        "267": "   * in the absence of any other character to provide a signal from which synchronism may be\n",
        "268": "   * achieved or retained.\n",
        "275": "   * End of Transmission Block: A communication control character used to indicate the end of a\n",
        "276": "   * block of data for communication purposes. ETB is used for blocking data where the block\n",
        "277": "   * structure is not necessarily related to the processing format.\n",
        "284": "   * Cancel: A control character used to indicate that the data with which it is sent is in error or\n",
        "285": "   * is to be disregarded.\n",
        "292": "   * End of Medium: A control character associated with the sent data which may be used to identify\n",
        "293": "   * the physical end of the medium, or the end of the used, or wanted, portion of information\n",
        "294": "   * recorded on a medium. (The position of this character does not necessarily correspond to the\n",
        "295": "   * physical end of the medium.)\n",
        "302": "   * Substitute: A character that may be substituted for a character which is determined to be\n",
        "303": "   * invalid or in error.\n",
        "310": "   * Escape: A control character intended to provide code extension (supplementary characters) in\n",
        "311": "   * general information interchange. The Escape character itself is a prefix affecting the\n",
        "312": "   * interpretation of a limited number of contiguously following characters.\n",
        "319": "   * File Separator: These four information separators may be used within data in optional fashion,\n",
        "320": "   * except that their hierarchical relationship shall be: FS is the most inclusive, then GS, then\n",
        "321": "   * RS, and US is least inclusive. (The content and length of a File, Group, Record, or Unit are\n",
        "322": "   * not specified.)\n",
        "329": "   * Group Separator: These four information separators may be used within data in optional fashion,\n",
        "330": "   * except that their hierarchical relationship shall be: FS is the most inclusive, then GS, then\n",
        "331": "   * RS, and US is least inclusive. (The content and length of a File, Group, Record, or Unit are\n",
        "332": "   * not specified.)\n",
        "339": "   * Record Separator: These four information separators may be used within data in optional\n",
        "340": "   * fashion, except that their hierarchical relationship shall be: FS is the most inclusive, then\n",
        "341": "   * GS, then RS, and US is least inclusive. (The content and length of a File, Group, Record, or\n",
        "342": "   * Unit are not specified.)\n",
        "349": "   * Unit Separator: These four information separators may be used within data in optional fashion,\n",
        "350": "   * except that their hierarchical relationship shall be: FS is the most inclusive, then GS, then\n",
        "351": "   * RS, and US is least inclusive. (The content and length of a File, Group, Record, or Unit are\n",
        "352": "   * not specified.)\n",
        "359": "   * Space: A normally non-printing graphic character used to separate words. It is also a format\n",
        "360": "   * effector which controls the movement of the printing position, one printing position forward.\n",
        "375": "   * Delete: This character is used primarily to \"erase\" or \"obliterate\" erroneous or unwanted\n",
        "376": "   * characters in perforated tape.\n",
        "526": "   * <p><b>Note:</b> This method <i>may</i> work with certain non-ASCII text but is not safe for use\n",
        "527": "   * with arbitrary Unicode text. It is mostly intended for use with text that is known to be safe\n",
        "528": "   * for use with it (such as all-ASCII text) and for simple debugging text. When using this method,\n",
        "529": "   * consider the following:\n",
        "532": "   * <li>it may split surrogate pairs</li>\n",
        "533": "   * <li>it may split characters and combining characters</li>\n",
        "534": "   * <li>it does not consider word boundaries</li>\n",
        "535": "   * <li>if truncating for display to users, there are other considerations that must be taken into\n",
        "536": "   * account</li>\n",
        "537": "   * <li>the appropriate truncation indicator may be locale-dependent</li>\n",
        "538": "   * <li>it is safe to use non-ASCII characters in the truncation indicator</li>\n",
        "590": "   * {@link String#equalsIgnoreCase}). However in almost all cases that ASCII strings are used, the\n",
        "591": "   * author probably wanted the behavior provided by this method rather than the subtle and\n",
        "624": "   * Returns the non-negative index value of the alpha character {@code c}, regardless of case. Ie,\n",
        "625": "   * 'a'/'A' returns 0 and 'z'/'Z' returns 25. Non-alpha characters return a value of 26 or greater.\n"
    },
    "removed": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\");\n",
        "5": " * you may not use this file except in compliance with the License.\n",
        "6": " * You may obtain a copy of the License at\n",
        "10": " * Unless required by applicable law or agreed to in writing, software\n",
        "11": " * distributed under the License is distributed on an \"AS IS\" BASIS,\n",
        "12": " * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n",
        "13": " * See the License for the specific language governing permissions and\n",
        "14": " * limitations under the License.\n",
        "26": " * Static methods pertaining to ASCII characters (those in the range of values\n",
        "27": " * {@code 0x00} through {@code 0x7F}), and to strings containing such\n",
        "28": " * characters.\n",
        "34": " * <li>{@link CharMatcher#ASCII} matches ASCII characters and provides text processing methods\n",
        "35": " *     which operate only on the ASCII characters of a string.\n",
        "49": "   * Null ('\\0'): The all-zeros character which may serve to accomplish\n",
        "50": "   * time fill and media fill.  Normally used as a C string terminator.\n",
        "51": "   * <p>Although RFC 20 names this as \"Null\", note that it is distinct\n",
        "52": "   * from the C/C++ \"NULL\" pointer.\n",
        "59": "   * Start of Heading: A communication control character used at\n",
        "60": "   * the beginning of a sequence of characters which constitute a\n",
        "61": "   * machine-sensible address or routing information.  Such a sequence is\n",
        "62": "   * referred to as the \"heading.\"  An STX character has the effect of\n",
        "63": "   * terminating a heading.\n",
        "70": "   * Start of Text: A communication control character which\n",
        "71": "   * precedes a sequence of characters that is to be treated as an entity\n",
        "72": "   * and entirely transmitted through to the ultimate destination.  Such a\n",
        "73": "   * sequence is referred to as \"text.\"  STX may be used to terminate a\n",
        "74": "   * sequence of characters started by SOH.\n",
        "81": "   * End of Text: A communication control character used to\n",
        "82": "   * terminate a sequence of characters started with STX and transmitted\n",
        "83": "   * as an entity.\n",
        "90": "   * End of Transmission: A communication control character used\n",
        "91": "   * to indicate the conclusion of a transmission, which may have\n",
        "92": "   * contained one or more texts and any associated headings.\n",
        "99": "   * Enquiry: A communication control character used in data\n",
        "100": "   * communication systems as a request for a response from a remote\n",
        "101": "   * station.  It may be used as a \"Who Are You\" (WRU) to obtain\n",
        "109": "   * Acknowledge: A communication control character transmitted\n",
        "110": "   * by a receiver as an affirmative response to a sender.\n",
        "117": "   * Bell ('\\a'): A character for use when there is a need to call for\n",
        "118": "   * human attention.  It may control alarm or attention devices.\n",
        "125": "   * Backspace ('\\b'): A format effector which controls the movement of\n",
        "126": "   * the printing position one printing space backward on the same\n",
        "127": "   * printing line.  (Applicable also to display devices.)\n",
        "134": "   * Horizontal Tabulation ('\\t'): A format effector which controls the\n",
        "135": "   * movement of the printing position to the next in a series of\n",
        "136": "   * predetermined positions along the printing line.  (Applicable also to\n",
        "137": "   * display devices and the skip function on punched cards.)\n",
        "144": "   * Line Feed ('\\n'): A format effector which controls the movement of\n",
        "145": "   * the printing position to the next printing line.  (Applicable also to\n",
        "146": "   * display devices.) Where appropriate, this character may have the\n",
        "147": "   * meaning \"New Line\" (NL), a format effector which controls the\n",
        "148": "   * movement of the printing point to the first printing position on the\n",
        "149": "   * next printing line.  Use of this convention requires agreement\n",
        "150": "   * between sender and recipient of data.\n",
        "157": "   * Alternate name for {@link #LF}.  ({@code LF} is preferred.)\n",
        "164": "   * Vertical Tabulation ('\\v'): A format effector which controls the\n",
        "165": "   * movement of the printing position to the next in a series of\n",
        "166": "   * predetermined printing lines.  (Applicable also to display devices.)\n",
        "173": "   * Form Feed ('\\f'): A format effector which controls the movement of\n",
        "174": "   * the printing position to the first pre-determined printing line on\n",
        "175": "   * the next form or page.  (Applicable also to display devices.)\n",
        "182": "   * Carriage Return ('\\r'): A format effector which controls the\n",
        "183": "   * movement of the printing position to the first printing position on\n",
        "184": "   * the same printing line.  (Applicable also to display devices.)\n",
        "191": "   * Shift Out: A control character indicating that the code\n",
        "192": "   * combinations which follow shall be interpreted as outside of the\n",
        "193": "   * character set of the standard code table until a Shift In character\n",
        "194": "   * is reached.\n",
        "201": "   * Shift In: A control character indicating that the code\n",
        "202": "   * combinations which follow shall be interpreted according to the\n",
        "203": "   * standard code table.\n",
        "210": "   * Data Link Escape: A communication control character which\n",
        "211": "   * will change the meaning of a limited number of contiguously following\n",
        "212": "   * characters.  It is used exclusively to provide supplementary controls\n",
        "213": "   * in data communication networks.\n",
        "220": "   * Device Control 1. Characters for the control\n",
        "221": "   * of ancillary devices associated with data processing or\n",
        "222": "   * telecommunication systems, more especially switching devices \"on\" or\n",
        "223": "   * \"off.\"  (If a single \"stop\" control is required to interrupt or turn\n",
        "224": "   * off ancillary devices, DC4 is the preferred assignment.)\n",
        "231": "   * Transmission On: Although originally defined as DC1, this ASCII\n",
        "232": "   * control character is now better known as the XON code used for software\n",
        "233": "   * flow control in serial communications.  The main use is restarting\n",
        "234": "   * the transmission after the communication has been stopped by the XOFF\n",
        "235": "   * control code.\n",
        "242": "   * Device Control 2. Characters for the control\n",
        "243": "   * of ancillary devices associated with data processing or\n",
        "244": "   * telecommunication systems, more especially switching devices \"on\" or\n",
        "245": "   * \"off.\"  (If a single \"stop\" control is required to interrupt or turn\n",
        "246": "   * off ancillary devices, DC4 is the preferred assignment.)\n",
        "253": "   * Device Control 3. Characters for the control\n",
        "254": "   * of ancillary devices associated with data processing or\n",
        "255": "   * telecommunication systems, more especially switching devices \"on\" or\n",
        "256": "   * \"off.\"  (If a single \"stop\" control is required to interrupt or turn\n",
        "257": "   * off ancillary devices, DC4 is the preferred assignment.)\n",
        "271": "   * Device Control 4. Characters for the control\n",
        "272": "   * of ancillary devices associated with data processing or\n",
        "273": "   * telecommunication systems, more especially switching devices \"on\" or\n",
        "274": "   * \"off.\"  (If a single \"stop\" control is required to interrupt or turn\n",
        "275": "   * off ancillary devices, DC4 is the preferred assignment.)\n",
        "282": "   * Negative Acknowledge: A communication control character\n",
        "283": "   * transmitted by a receiver as a negative response to the sender.\n",
        "290": "   * Synchronous Idle: A communication control character used by\n",
        "291": "   * a synchronous transmission system in the absence of any other\n",
        "292": "   * character to provide a signal from which synchronism may be achieved\n",
        "293": "   * or retained.\n",
        "300": "   * End of Transmission Block: A communication control character\n",
        "301": "   * used to indicate the end of a block of data for communication\n",
        "302": "   * purposes.  ETB is used for blocking data where the block structure is\n",
        "303": "   * not necessarily related to the processing format.\n",
        "310": "   * Cancel: A control character used to indicate that the data\n",
        "311": "   * with which it is sent is in error or is to be disregarded.\n",
        "318": "   * End of Medium: A control character associated with the sent\n",
        "319": "   * data which may be used to identify the physical end of the medium, or\n",
        "320": "   * the end of the used, or wanted, portion of information recorded on a\n",
        "321": "   * medium.  (The position of this character does not necessarily\n",
        "322": "   * correspond to the physical end of the medium.)\n",
        "329": "   * Substitute: A character that may be substituted for a\n",
        "330": "   * character which is determined to be invalid or in error.\n",
        "337": "   * Escape: A control character intended to provide code\n",
        "338": "   * extension (supplementary characters) in general information\n",
        "339": "   * interchange.  The Escape character itself is a prefix affecting the\n",
        "340": "   * interpretation of a limited number of contiguously following\n",
        "341": "   * characters.\n",
        "348": "   * File Separator: These four information separators may be\n",
        "349": "   * used within data in optional fashion, except that their hierarchical\n",
        "350": "   * relationship shall be: FS is the most inclusive, then GS, then RS,\n",
        "351": "   * and US is least inclusive.  (The content and length of a File, Group,\n",
        "352": "   * Record, or Unit are not specified.)\n",
        "359": "   * Group Separator: These four information separators may be\n",
        "360": "   * used within data in optional fashion, except that their hierarchical\n",
        "361": "   * relationship shall be: FS is the most inclusive, then GS, then RS,\n",
        "362": "   * and US is least inclusive.  (The content and length of a File, Group,\n",
        "363": "   * Record, or Unit are not specified.)\n",
        "370": "   * Record Separator: These four information separators may be\n",
        "371": "   * used within data in optional fashion, except that their hierarchical\n",
        "372": "   * relationship shall be: FS is the most inclusive, then GS, then RS,\n",
        "373": "   * and US is least inclusive.  (The content and length of a File, Group,\n",
        "374": "   * Record, or Unit are not specified.)\n",
        "381": "   * Unit Separator: These four information separators may be\n",
        "382": "   * used within data in optional fashion, except that their hierarchical\n",
        "383": "   * relationship shall be: FS is the most inclusive, then GS, then RS,\n",
        "384": "   * and US is least inclusive.  (The content and length of a File, Group,\n",
        "385": "   * Record, or Unit are not specified.)\n",
        "392": "   * Space: A normally non-printing graphic character used to\n",
        "393": "   * separate words.  It is also a format effector which controls the\n",
        "394": "   * movement of the printing position, one printing position forward.\n",
        "409": "   * Delete: This character is used primarily to \"erase\" or\n",
        "410": "   * \"obliterate\" erroneous or unwanted characters in perforated tape.\n",
        "560": "   * <p><b>Note:</b> This method <i>may</i> work with certain non-ASCII text but is not safe for\n",
        "561": "   * use with arbitrary Unicode text. It is mostly intended for use with text that is known to be\n",
        "562": "   * safe for use with it (such as all-ASCII text) and for simple debugging text. When using this\n",
        "563": "   * method, consider the following:\n",
        "566": "   *   <li>it may split surrogate pairs</li>\n",
        "567": "   *   <li>it may split characters and combining characters</li>\n",
        "568": "   *   <li>it does not consider word boundaries</li>\n",
        "569": "   *   <li>if truncating for display to users, there are other considerations that must be taken\n",
        "570": "   *   into account</li>\n",
        "571": "   *   <li>the appropriate truncation indicator may be locale-dependent</li>\n",
        "572": "   *   <li>it is safe to use non-ASCII characters in the truncation indicator</li>\n",
        "624": "   * {@link String#equalsIgnoreCase}). However in almost all cases that ASCII strings are used,\n",
        "625": "   * the author probably wanted the behavior provided by this method rather than the subtle and\n",
        "658": "   * Returns the non-negative index value of the alpha character {@code c}, regardless of case.\n",
        "659": "   * Ie, 'a'/'A' returns 0 and 'z'/'Z' returns 25. Non-alpha characters return a value of 26 or\n",
        "660": "   * greater.\n"
    }
}