{
    "addition": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except\n",
        "5": " * in compliance with the License. You may obtain a copy of the License at\n",
        "9": " * Unless required by applicable law or agreed to in writing, software distributed under the License\n",
        "10": " * is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express\n",
        "11": " * or implied. See the License for the specific language governing permissions and limitations under\n",
        "12": " * the License.\n",
        "24": " * Signifies that a public API (public class, method or field) is subject to incompatible changes,\n",
        "25": " * or even removal, in a future release. An API bearing this annotation is exempt from any\n",
        "26": " * compatibility guarantees made by its containing library. Note that the presence of this\n",
        "27": " * annotation implies nothing about the quality or performance of the API in question, only the fact\n",
        "28": " * that it is not \"API-frozen.\"\n",
        "30": " * <p>It is generally safe for <i>applications</i> to depend on beta APIs, at the cost of some extra\n",
        "31": " * work during upgrades. However it is generally inadvisable for <i>libraries</i> (which get\n",
        "32": " * included on users' CLASSPATHs, outside the library developers' control) to do so.\n",
        "39": "  ElementType.ANNOTATION_TYPE,\n",
        "40": "  ElementType.CONSTRUCTOR,\n",
        "41": "  ElementType.FIELD,\n",
        "42": "  ElementType.METHOD,\n",
        "43": "  ElementType.TYPE\n",
        "44": "})\n"
    },
    "removed": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\");\n",
        "5": " * you may not use this file except in compliance with the License.\n",
        "6": " * You may obtain a copy of the License at\n",
        "10": " * Unless required by applicable law or agreed to in writing, software\n",
        "11": " * distributed under the License is distributed on an \"AS IS\" BASIS,\n",
        "12": " * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n",
        "13": " * See the License for the specific language governing permissions and\n",
        "14": " * limitations under the License.\n",
        "26": " * Signifies that a public API (public class, method or field) is subject to\n",
        "27": " * incompatible changes, or even removal, in a future release. An API bearing\n",
        "28": " * this annotation is exempt from any compatibility guarantees made by its\n",
        "29": " * containing library. Note that the presence of this annotation implies nothing\n",
        "30": " * about the quality or performance of the API in question, only the fact that\n",
        "31": " * it is not \"API-frozen.\"\n",
        "33": " * <p>It is generally safe for <i>applications</i> to depend on beta APIs, at\n",
        "34": " * the cost of some extra work during upgrades. However it is generally\n",
        "35": " * inadvisable for <i>libraries</i> (which get included on users' CLASSPATHs,\n",
        "36": " * outside the library developers' control) to do so.\n",
        "43": "    ElementType.ANNOTATION_TYPE,\n",
        "44": "    ElementType.CONSTRUCTOR,\n",
        "45": "    ElementType.FIELD,\n",
        "46": "    ElementType.METHOD,\n",
        "47": "    ElementType.TYPE})\n"
    }
}