{
    "addition": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except\n",
        "5": " * in compliance with the License. You may obtain a copy of the License at\n",
        "9": " * Unless required by applicable law or agreed to in writing, software distributed under the License\n",
        "10": " * is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express\n",
        "11": " * or implied. See the License for the specific language governing permissions and limitations under\n",
        "12": " * the License.\n",
        "27": " * from an existing {@link ExecutorService}, call {@link\n",
        "28": " * MoreExecutors#listeningDecorator(ExecutorService)}.\n",
        "66": "   *     sequential order as produced by the iterator for the given task list, each of which has\n",
        "67": "   *     completed.\n",
        "86": "   *     sequential order as produced by the iterator for the given task list. If the operation did\n",
        "87": "   *     not time out, each task will have completed. If it did time out, some of these tasks will\n",
        "88": "   *     not have completed.\n"
    },
    "removed": {
        "4": " * Licensed under the Apache License, Version 2.0 (the \"License\");\n",
        "5": " * you may not use this file except in compliance with the License.\n",
        "6": " * You may obtain a copy of the License at\n",
        "10": " * Unless required by applicable law or agreed to in writing, software\n",
        "11": " * distributed under the License is distributed on an \"AS IS\" BASIS,\n",
        "12": " * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n",
        "13": " * See the License for the specific language governing permissions and\n",
        "14": " * limitations under the License.\n",
        "29": " * from an existing {@link ExecutorService}, call\n",
        "30": " * {@link MoreExecutors#listeningDecorator(ExecutorService)}.\n",
        "68": "   *         sequential order as produced by the iterator for the given task list, each of which has\n",
        "69": "   *         completed.\n",
        "88": "   *         sequential order as produced by the iterator for the given task list. If the operation\n",
        "89": "   *         did not time out, each task will have completed. If it did time out, some of these\n",
        "90": "   *         tasks will not have completed.\n"
    }
}